[
  {
    "statusCode": 200,
    "statusMessage": "FOUND",
    "sellerId": "A2AGRXPN4RKYKO",
    "domainCode": "com",
    "aboutSeller": "Hybrid IT is dedicated to making technology accessible to everyone. We sell like-new and refurbished smartphones and tablets in online marketplaces around the world, at prices perfect for any budget. When it comes to refurbished devices, we understand that nothing matters more than quality and reliability. You want a device you’ll love, at a price you can afford, from a company you can trust. That’s why we’ve built a state-of-the-art repair facility – and are capable and approved to restore devi... Hybrid IT is dedicated to making technology accessible to everyone. We sell like-new and refurbished smartphones and tablets in online marketplaces around the world, at prices perfect for any budget. When it comes to refurbished devices, we understand that nothing matters more than quality and reliability. You want a device you’ll love, at a price you can afford, from a company you can trust. That’s why we’ve built a state-of-the-art repair facility – and are capable and approved to restore devices to manufacturer and carrier specifications. That’s why we hire experienced technicians and follow the very important ISO quality control standards. And that’s why every device that comes through our hands goes through a rigorous 65+ point inspection. All to make sure that our customers get a device that works exactly as expected. And if it doesn’t, we’ll take it back. With a no questions asked, 90-day Guarantee! See moreSee less",
    "sellerName": "Hybrid IT",
    "storefrontUrl": "/s?ie=UTF8&marketplaceID=ATVPDKIKX0DER&me=A2AGRXPN4RKYKO",
    "countRating": 864,
    "percentageRating": 5,
    "rating": 5,
    "sellerContactPhone": "917-432-7186",
    "sellerDetails": {
      "Business Address:": "621 E 132ND ST|Bronx|NY|10454|US",
      "Business Name:": "GSM CLUB PARTNERS LLC"
    },
    "feedbackSummary": {
      "thirtyDays": {
        "one_star": "0",
        "four_star": "8",
        "five_star": "40",
        "three_star": "0",
        "two_star": "0"
      },
      "ninetyDays": {
        "one_star": "0",
        "four_star": "20",
        "five_star": "115",
        "three_star": "0",
        "two_star": "0"
      },
      "twelveMonths": {
        "one_star": "3",
        "four_star": "118",
        "five_star": "742",
        "three_star": "0",
        "two_star": "1"
      },
      "lifeTime": {
        "one_star": "54",
        "four_star": "1198",
        "five_star": "8460",
        "three_star": "14",
        "two_star": "10"
      }
    },
    "feedback": [
      {
        "rating": 4,
        "text": "My daughter love it",
        "rater": "By Reinaldo G. on September 23, 2025."
      },
      {
        "rating": 4,
        "text": "I have not received my refund. would you please check? thanks",
        "rater": "By Dorothy Williams on September 23, 2025."
      },
      {
        "rating": 1,
        "text": "I can't imagine that this package would take this long. I'm very unhappy with the shipping that I paid for.",
        "rater": "By April N Cumby on September 22, 2025."
      },
      {
        "rating": 5,
        "text": "Thanks",
        "rater": "By Frequent user on September 22, 2025."
      },
      {
        "rating": 5,
        "text": "Excelente",
        "rater": "By OmalonPR on September 21, 2025."
      }
    ]
  }
]